[M_IrisDL2_DontTalkAbtMama MissionDefinition]
TurnInDescription="You successfully dealt with what shall, unfortunately, forever be referred to as ''The Hamhock Situation''."

[M_IrisDL2_DontTalkAbtMama:KillScooterMen MissionObjectiveDefinition]
ProgressMessage="Kill gunmen for Moxxi"

[M_IrisDL2_DontTalkAbtMama:MissionObjectiveSetBranchingDefinition_0 MissionObjectiveSetBranchingDefinition]
MissionDescriptionOverride="A biker named Hamhock attempted to cop a feel on Scooter's mom, Moxxi. Scooter has ordered you to find Hamhock and take him out.<br><br>Upon finding Hamhock, however, Moxxi contacted you. After pointing out that her relations with Hamhock had been consensual, she proposed a counter-offer: if you spare Hamhock and kill Scooter's other hitmen, she'll make it worth your while.<br><br>Scooter, meanwhile, has pointed out that Hamhock is a murderous bastard and that if you kill him, he'll also make it worth your while.<br><br>It appears you have a decision to make."
